stevenj/avr-libc3/include/avr/io/attiny4313.h
/* Watch-dog Timer always on */
typedef enum FUSE_WDTON_enum
{
    FUSE_WDTON_CLEAR_gc = (0x00), /* Watch-dog Timer always on - CLEAR */
    FUSE_WDTON_SET_gc   = (0x10), /* Watch-dog Timer always on - SET */
} FUSE_WDTON_t;

/* Brown-out Detector trigger level */
typedef enum FUSE_BODLEVEL_enum
{
    FUSE_BODLEVEL_4V3_gc      = (0x04<<1), /* Brown-out detection at VCC=4.3 V */
    FUSE_BODLEVEL_2V7_gc      = (0x05<<1), /* Brown-out detection at VCC=2.7 V */
    FUSE_BODLEVEL_1V8_gc      = (0x06<<1), /* Brown-out detection at VCC=1.8 V */
    FUSE_BODLEVEL_DISABLED_gc = (0x07<<1), /* Brown-out detection disabled */
} FUSE_BODLEVEL_t;

/* External reset disable */
typedef enum FUSE_RSTDISBL_enum
{
    FUSE_RSTDISBL_CLEAR_gc = (0x00), /* External reset disable - CLEAR */
    FUSE_RSTDISBL_SET_gc   = (0x01), /* External reset disable - SET */
} FUSE_RSTDISBL_t;

/* Divide clock by 8 internally */
typedef enum FUSE_CKDIV8_enum
{
    FUSE_CKDIV8_CLEAR_gc = (0x00), /* Divide clock by 8 internally - CLEAR */
    FUSE_CKDIV8_SET_gc   = (0x80), /* Divide clock by 8 internally - SET */
} FUSE_CKDIV8_t;

/* Clock output on PORTD2 */
typedef enum FUSE_CKOUT_enum
{
    FUSE_CKOUT_CLEAR_gc = (0x00), /* Clock output on PORTD2 - CLEAR */
    FUSE_CKOUT_SET_gc   = (0x40), /* Clock output on PORTD2 - SET */
} FUSE_CKOUT_t;

/* Select Clock Source */
typedef enum FUSE_SUT_CKSEL_enum
{
    FUSE_SUT_CKSEL_EXTCLK_14CK_0MS_gc               = (0x00), /* Ext. Clock; Start-up time: 14 CK + 0   ms */
    FUSE_SUT_CKSEL_EXTCLK_14CK_4MS1_gc              = (0x10), /* Ext. Clock; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTCLK_14CK_65MS_gc              = (0x20), /* Ext. Clock; Start-up time: 14 CK + 65  ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_0MS_gc        = (0x02), /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 0   ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_4MS1_gc       = (0x12), /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_65MS_gc       = (0x22), /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 65  ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_0MS_gc        = (0x04), /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 0   ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_4MS1_gc       = (0x14), /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_65MS_gc       = (0x24), /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65  ms */
    FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_0MS_gc      = (0x06), /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_4MS_gc      = (0x16), /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 4 ms */
    FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_64MS_gc     = (0x26), /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc = (0x08), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc = (0x18), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_0MS_gc  = (0x28), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc = (0x38), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc = (0x09), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_0MS_gc  = (0x19), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc = (0x29), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc = (0x39), /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc  = (0x0A), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc  = (0x1A), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_0MS_gc   = (0x2A), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc  = (0x3A), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc  = (0x0B), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_0MS_gc   = (0x1B), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc  = (0x2B), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc  = (0x3B), /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc   = (0x0C), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc   = (0x1C), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_0MS_gc    = (0x2C), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc   = (0x3C), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc   = (0x0D), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_0MS_gc    = (0x1D), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc   = (0x2D), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc   = (0x3D), /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc     = (0x0E), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc     = (0x1E), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_0MS_gc      = (0x2E), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc     = (0x3E), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc     = (0x0F), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_0MS_gc      = (0x1F), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc     = (0x2F), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms */
    FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc     = (0x3F), /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms */
} FUSE_SUT_CKSEL_t;

