stevenj/avr-libc3/include/avr/io/attiny4313.h
/* USART - USART (0x0000) */
#define USART_BASE      _SFR_MEM8 (0x0000) /* USART Base Address */
#define USART_UBRRH     _SFR_MEM8 (0x0022) /* USART Baud Rate Register High Byte */
#define USART_UCSRC     _SFR_MEM8 (0x0023) /* USART Control and Status Register C */
#define USART_UBRRL     _SFR_MEM8 (0x0029) /* USART Baud Rate Register Low Byte */
#define USART_UCSRB     _SFR_MEM8 (0x002A) /* USART Control and Status Register B */
#define USART_UCSRA     _SFR_MEM8 (0x002B) /* USART Control and Status Register A */
#define USART_UDR       _SFR_MEM8 (0x002C) /* USART I/O Data Register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_DIDR         _SFR_MEM8 (0x0021) /* Digital Input Disable Register 1 */
#define AC_ACSR         _SFR_MEM8 (0x0028) /* Analog Comparator Control And Status Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE     _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR     _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR     _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR     _SFR_MEM8 (0x003E) /* EEPROM Read/Write Access */

/* USI - Universal Serial Interface (0x0000) */
#define USI_BASE        _SFR_MEM8 (0x0000) /* USI Base Address */
#define USI_USICR       _SFR_MEM8 (0x002D) /* USI Control Register */
#define USI_USISR       _SFR_MEM8 (0x002E) /* USI Status Register */
#define USI_USIDR       _SFR_MEM8 (0x002F) /* USI Data Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK1    _SFR_MEM8 (0x0024) /* Pin Change Interrupt Mask Register 1 */
#define EXINT_PCMSK2    _SFR_MEM8 (0x0025) /* Pin Change Interrupt Mask Register 2 */
#define EXINT_PCMSK0    _SFR_MEM8 (0x0040) /* Pin Change Interrupt Mask Register 0 */
#define EXINT_GIFR      _SFR_MEM8 (0x005A) /* General Interrupt Flag Register */
#define EXINT_GIMSK     _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_PRR         _SFR_MEM8 (0x0026) /* Power reduction register */
#define CPU_BODCR       _SFR_MEM8 (0x0027) /* BOD control register */
#define CPU_GPIOR0      _SFR_MEM8 (0x0033) /* General Purpose I/O Register 0 */
#define CPU_GPIOR1      _SFR_MEM8 (0x0034) /* General Purpose I/O Register 1 */
#define CPU_GPIOR2      _SFR_MEM8 (0x0035) /* General Purpose I/O Register 2 */
#define CPU_GTCCR       _SFR_MEM8 (0x0043) /* General Timer Counter Control Register */
#define CPU_CLKPR       _SFR_MEM8 (0x0046) /* Clock Prescale Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0051) /* Oscillator Calibration Register */
#define CPU_MCUSR       _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPMCSR      _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status register */
#define CPU_SP          _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED   _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_TIMER1_CAPT_vect_num  (3)                 
#define None_TIMER1_CAPT_vect      _VECTOR(3)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (4)                 
#define None_TIMER1_COMPA_vect     _VECTOR(4)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_OVF_vect_num   (5)                 
#define None_TIMER1_OVF_vect       _VECTOR(5)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num   (6)                 
#define None_TIMER0_OVF_vect       _VECTOR(6)          /* Timer/Counter0 Overflow */
#define None_USART_RX_vect_num     (7)                 
#define None_USART_RX_vect         _VECTOR(7)          /* USART, Rx Complete */
#define None_USART_UDRE_vect_num   (8)                 
#define None_USART_UDRE_vect       _VECTOR(8)          /* USART Data Register Empty */
#define None_USART_TX_vect_num     (9)                 
#define None_USART_TX_vect         _VECTOR(9)          /* USART, Tx Complete */
#define None_ANA_COMP_vect_num     (10)                
#define None_ANA_COMP_vect         _VECTOR(10)         /* Analog Comparator */
#define None_PCINT_B_vect_num      (11)                
#define None_PCINT_B_vect          _VECTOR(11)         /* Pin Change Interrupt Request B */
#define None_TIMER1_COMPB_vect_num (12)                
#define None_TIMER1_COMPB_vect     _VECTOR(12)         
#define None_TIMER0_COMPA_vect_num (13)                
#define None_TIMER0_COMPA_vect     _VECTOR(13)         
#define None_TIMER0_COMPB_vect_num (14)                
#define None_TIMER0_COMPB_vect     _VECTOR(14)         
#define None_USI_START_vect_num    (15)                
#define None_USI_START_vect        _VECTOR(15)         /* USI Start Condition */
#define None_USI_OVERFLOW_vect_num (16)                
#define None_USI_OVERFLOW_vect     _VECTOR(16)         /* USI Overflow */
#define None_EEPROM_Ready_vect_num (17)                
#define None_EEPROM_Ready_vect     _VECTOR(17)         
#define None_WDT_OVERFLOW_vect_num (18)                
#define None_WDT_OVERFLOW_vect     _VECTOR(18)         /* Watchdog Timer Overflow */
#define None_PCINT_A_vect_num      (19)                
#define None_PCINT_A_vect          _VECTOR(19)         /* Pin Change Interrupt Request A */
#define None_PCINT_D_vect_num      (20)                
#define None_PCINT_D_vect          _VECTOR(20)         /* Pin Change Interrupt Request D */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (21 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x1000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

